app/Controllers/Client/Auth.php

    public function loginPost()
    {
        try {
            $post = $this->request->getPost();
            $rules = [
                'username' => 'required',
                'password' => 'required'
            ];

            if (! $this->validate($rules)) {
                return redirect()->back()->withInput()->with('error', $this->validator->getErrors());
            }

            // Allow login by username or phone or email (try username first)
            $identifier = $post['username'];

            $client = $this->clientModel
                ->where('username', $identifier)
                ->orWhere('email', $identifier)
                ->orWhere('phone', $identifier)
                ->first();
---
SELECT *
FROM `clients`
WHERE `username` = 'petermalaba'
OR `email` = 'petermalaba'
OR `phone` = 'petermalaba'
 LIMIT 1