app/Controllers/Client/Dashboard.php

SELECT `subscriptions`.*, `packages`.`name` AS `package_name`, `packages`.`duration_length`, `packages`.`duration_unit`, `routers`.`name` AS `router_name`
FROM `subscriptions`
LEFT JOIN `packages` ON `packages`.`id` = `subscriptions`.`package_id`
LEFT JOIN `routers` ON `routers`.`id` = `subscriptions`.`router_id`
WHERE `subscriptions`.`client_id` = '8'
ORDER BY `subscriptions`.`start_date` DESC
SELECT `vouchers`.*, `packages`.`name` AS `package_name`, `packages`.`duration_length`, `packages`.`duration_unit`
FROM `vouchers`
LEFT JOIN `packages` ON `packages`.`id` = `vouchers`.`package_id`
WHERE `vouchers`.`used_by_client_id` = '8'
ORDER BY `vouchers`.`updated_at` DESC
---
    public function index()
    {
        $clientId = session()->get('client_id');
        if (!$clientId) {
            return redirect()->to('/client/login');
        }

        // Fetch subscriptions for this client
        $subscriptions = $this->subscriptionModel
            ->select('
                subscriptions.*,
                packages.name AS package_name,
                packages.duration_length,
                packages.duration_unit,
                routers.name AS router_name
            ')
            ->join('packages', 'packages.id = subscriptions.package_id', 'left')
            ->join('routers', 'routers.id = subscriptions.router_id', 'left')
            ->where('subscriptions.client_id', $clientId)
            ->orderBy('subscriptions.start_date', 'DESC')
            ->findAll();

        // Fetch vouchers that have been redeemed/used by this client
        $vouchers = $this->voucherModel
            ->select('
                vouchers.*,
                packages.name AS package_name,
                packages.duration_length,
                packages.duration_unit
            ')
            ->join('packages', 'packages.id = vouchers.package_id', 'left')
            ->where('vouchers.used_by_client_id', $clientId)
            ->orderBy('vouchers.updated_at', 'DESC')
            ->findAll();