app/Controllers/Client/Packages.php

SELECT *
FROM `packages`
---
    public function index()
    {
        $packages = $this->packageModel->findAll();

SELECT *
FROM `packages`
WHERE `packages`.`id` = '29'
---
    public function view($id)
    {
        $package = $this->packageModel->find($id);