app/Controllers/Client/Payments.php

SELECT *
FROM `packages`
WHERE `packages`.`id` = '31'
---
    public function checkout($packageId)
    {
        $clientId = session()->get('client_id');
        if (!$clientId) return redirect()->to('/client/login');

        $package = $this->packageModel->find($packageId);

SELECT *
FROM `packages`
WHERE `packages`.`id` = '31'
SELECT *
FROM `clients`
WHERE `clients`.`id` = '8'
---
    public function process()
    {
        helper(['mpesa_logger', 'mpesa_debug']);
        mpesa_debug_clear();
        mpesa_debug("=== New Payment Process Started ===");
        mpesa_log("=== New Payment Process Started ===");

        $clientId = session()->get('client_id');
        if (!$clientId) return redirect()->to('/client/login');

        $packageId   = $this->request->getPost('package_id');
        $voucherCode = trim($this->request->getPost('voucher_code'));
        $phone       = trim($this->request->getPost('phone'));

        $package = $this->packageModel->find($packageId);
        if (!$package) {
            mpesa_debug("❌ Package not found: {$packageId}");
            mpesa_log("❌ Package not found: {$packageId}");
            return redirect()->to('/client/packages')->with('error', 'Package not found.');
        }

        $client = $this->clientModel->find($clientId);

SELECT *
FROM `mpesa_transactions`
WHERE `client_id` = '8'
ORDER BY `id` DESC
 LIMIT 1
---
    public function checkStatus()
    {
        $clientId = session()->get('client_id');
        if (!$clientId) {
            return $this->response->setJSON(['status' => 'unauthorized']);
        }

        $mpesaTx = $this->mpesaTransactionModel
            ->where('client_id', $clientId)
            ->orderBy('id', 'DESC')
            ->first();