app/Controllers/Client/Payments.php

SELECT *
FROM `subscriptions`
WHERE `id` = '8'
AND `client_id` = '8'
 LIMIT 1
---
    public function success($subscriptionId)
    {
        $clientId = session()->get('client_id');
        if (!$clientId) return redirect()->to('/client/login');

        $subscription = $this->subscriptionModel
            ->where('id', $subscriptionId)
            ->where('client_id', $clientId)
            ->first();