app/Controllers/Client/Profile.php

    public function index()
    {
        $clientModel = new ClientModel();
        $clientId = session()->get('client_id');

        try {
            $data['client'] = $clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = '8'