app/Controllers/Client/Subscriptions.php

SELECT `subscriptions`.*, `packages`.`name` AS `package_name`, `packages`.`account_type` AS `package_account_type`, `packages`.`type` AS `package_type`, `packages`.`price` AS `price`, `routers`.`name` AS `router_name`
FROM `subscriptions`
LEFT JOIN `packages` ON `packages`.`id` = `subscriptions`.`package_id`
LEFT JOIN `routers` ON `routers`.`id` = `subscriptions`.`router_id`
WHERE `subscriptions`.`client_id` = '8'
ORDER BY `subscriptions`.`start_date` DESC
---
    public function index()
    {
        $clientId = session()->get('client_id');

        $subscriptions = $this->subscriptionModel
            ->select('subscriptions.*,
                    packages.name AS package_name,
                    packages.account_type AS package_account_type,
                    packages.type AS package_type,
                    packages.price AS price,
                    routers.name AS router_name')
            ->join('packages', 'packages.id = subscriptions.package_id', 'left')
            ->join('routers', 'routers.id = subscriptions.router_id', 'left')
            ->where('subscriptions.client_id', $clientId)
            ->orderBy('subscriptions.start_date', 'DESC')
            ->findAll();