app/Controllers/AuthController.php

    public function processLogin()
    {
        $session = session();
        $model = new AdminModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $ip = $this->request->getIPAddress();

        $admin = $model->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'super@wifi.com'
 LIMIT 1