app/Controllers/Clients.php

SELECT *
FROM `clients`
ORDER BY `id` DESC
---
    public function index()
    {
        $this->ensureLogin();

        // optional filter for status ?status=active
        $status = $this->request->getGet('status');
        if ($status && in_array($status, ['active','inactive'])) {
            $data['clients'] = $this->clientModel->where('status', $status)->orderBy('id','DESC')->findAll();
        } else {
            $data['clients'] = $this->clientModel->orderBy('id','DESC')->findAll();

UPDATE `clients` SET `full_name` = 'Peter Malaba', `email` = 'petermalaba@gmail.com', `phone` = '254704359825', `status` = 'active', `updated_at` = '2025-11-02 14:12:56'
WHERE `clients`.`id` IN ('8')
---
    public function update($id)
    {
        try {
            $data = $this->request->getPost();

            if ($this->clientModel->update($id, $data)) {