app/Controllers/Dashboard.php

    public function index()
    {
        $clientModel = new ClientModel();
        $txnModel = new TransactionModel();
        $mpesaModel = new MpesaTransactionModel();
        $voucherModel = new VoucherModel();
        $packageModel = new PackageModel();
        $subscriptionModel = new SubscriptionModel();

        // Metrics
        $data['totalClients'] = $clientModel->countAllResults();
        $data['totalPackages'] = $packageModel->countAllResults();
        $data['totalVouchers'] = $voucherModel->countAllResults();
        $data['totalTransactions'] = $txnModel->countAllResults();

        // Active subscriptions
        $data['activeSubscriptions'] = $subscriptionModel->where('status', 'active')->countAllResults();

        // Recent data
        $data['recentTransactions'] = $txnModel->orderBy('created_on', 'DESC')->limit(5)->findAll();
        $data['recentClients'] = $clientModel->orderBy('created_at', 'DESC')->limit(5)->findAll();

        // Chart Data: Transactions per day (last 7 days)
        $chartData = $txnModel->select("DATE(created_on) as date, SUM(amount) as total")
            ->groupBy('DATE(created_on)')
            ->orderBy('DATE(created_on)', 'ASC')
            ->limit(7)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `clients`
SELECT COUNT(*) AS `numrows`
FROM `packages`
SELECT COUNT(*) AS `numrows`
FROM `vouchers`
SELECT COUNT(*) AS `numrows`
FROM `transactions`
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `status` = 'active'
SELECT *
FROM `transactions`
ORDER BY `created_on` DESC
 LIMIT 5
SELECT *
FROM `clients`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT DATE(created_on) as date, SUM(amount) as total
FROM `transactions`
GROUP BY DATE(created_on)
ORDER BY DATE(created_on) ASC
 LIMIT 7

        $data['chartValues'] = array_map('floatval', array_column($chartData, 'total'));

        // Voucher usage trends
        $voucherUsage = $voucherModel->select("DATE(used_at) as date, COUNT(id) as total")
            ->where('used_at IS NOT NULL')
            ->groupBy('DATE(used_at)')
            ->orderBy('DATE(used_at)', 'ASC')
            ->limit(7)
            ->findAll();
---
SELECT DATE(used_at) as date, COUNT(id) as total
FROM `vouchers`
WHERE `used_at` IS NOT NULL
GROUP BY DATE(used_at)
ORDER BY DATE(used_at) ASC
 LIMIT 7