app/Controllers/Mpesa.php

            }
        } else {
            // Mark failed if result code != 0
            $this->mpesaTransactionModel
                ->where('checkout_request_id', $checkoutRequestID)
                ->set([
                    'status'       => 'Failed',
                    'callback_raw' => $rawData,
                    'completed_at' => date('Y-m-d H:i:s'),
                ])
                ->update();
---
SELECT *
FROM `mpesa_transactions`
WHERE `checkout_request_id` = 'ws_CO_0311202512000000000001'