app/Controllers/Mpesa.php

UPDATE `mpesa_transactions` SET `status` = 'Success', `updated_at` = '2025-11-02 18:25:25'
WHERE `mpesa_transactions`.`id` IN ('16')
---

            // Handle failed payments
            if ($resultCode != 0) {
                $this->mpesaTransactionModel->update($transaction['id'], [
                    'status'     => 'Failed',
                    'updated_at' => date('Y-m-d H:i:s')
                ]);