app/Models/VoucherModel.php

    public function getAllWithPackage()
    {
        return $this->select('
                vouchers.*,
                packages.name AS package_name,
                packages.price AS package_price,
                routers.name AS router_name
            ')
            ->join('packages', 'packages.id = vouchers.package_id', 'left')
            ->join('routers', 'routers.id = vouchers.router_id', 'left')
            ->orderBy('vouchers.created_at', 'DESC')
            ->findAll();
---
SELECT `vouchers`.*, `packages`.`name` AS `package_name`, `packages`.`price` AS `package_price`, `routers`.`name` AS `router_name`
FROM `vouchers`
LEFT JOIN `packages` ON `packages`.`id` = `vouchers`.`package_id`
LEFT JOIN `routers` ON `routers`.`id` = `vouchers`.`router_id`
ORDER BY `vouchers`.`created_at` DESC

    public function isValidVoucher(string $code): ?array
    {
        $voucher = $this->where('code', $code)
                        ->where('status', 'unused')
                        ->first();
---
SELECT *
FROM `vouchers`
WHERE `code` = 'D4409FBD55555'
AND `status` = 'unused'
 LIMIT 1